Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# sortby_password_modification_date_normal_mode
source: Newest First
ar: الأحدث أولاً
de: Neuste zuerst
es: Más nuevo primero
fr: Les plus récents en premier
hu: Legújabb elöl
it: Prima i più recenti
ja: 新しい順
ko: 새로운 순
pt_br: Mais Recentes Primeiro
pt_pt: Novos primeiro
ru: Сначала новые
uk: Спочатку нові
zh_hans: 按密码修改日期从新到旧排序

# sortby_password_modification_date_reverse_mode
source: Oldest First
ar: الأقدم أولاً
de: Älteste zuerst
es: Más antiguo primero
fr: Plus ancien en premier
hu: Legrégebbi elöl
it: Prima i più vecchi
ja: 古い順
ko: 오래된 순
pt_br: Mais Antigos Primeiro
pt_pt: Antigos primeiro
ru: Сначала старые
uk: Спочатку старіші
zh_hans: 按密码修改日期从旧到新排序

# sortby_password_modification_date_title
source: Password modification date
ar: تاريخ تعديل كلمة المرور
de: Passwort Änderungsdatum
es: Fecha de modificación de la contraseña
fr: Date de modification du mot de passe
hu: Jelszó módosításának dátuma
it: Data modifica password
ja: パスワード更新日
ko: 비밀번호 변경 날짜
pt_br: Data de alteração da senha
pt_pt: Data de alteração
ru: Дата изменения пароля
uk: Датою зміни паролю
zh_hans: 按密码修改日期排序

# sortby_password_normal_mode
source: Alphabetically
ar: أبجديا
de: Alphabetisch
es: Alfabético
fr: Alphabétiquement
hu: Betűrendben
it: Ordine alfabetico
ja: アルファベット順
ko: 가나다순
pt_br: Ordem Alfabética
pt_pt: Ordem alfabética
ru: По возрастанию (от A до Я)
uk: В алфавітному порядку
zh_hans: 按密码字母排序

# sortby_password_reverse_mode
source: Reverse Alphabetically
ar: عكس أبجديا
de: Umgekehrt Alphabetisch
es: Alfabético inverso
fr: Ordre anti-alphabétique
hu: Fordított betűrendben
it: Ordine alfabetico inverso
ja: アルファベット逆順
ko: 가나다 역순
pt_br: Ordem Alfabética Reversa
pt_pt: Ordem alfabética reversa
ru: По убыванию (от Я до А)
uk: Зворотний алфавітний порядок
zh_hans: 按密码字母反向排序

# sortby_password_strength_normal_mode
source: Weakest First
ar: الأضعف أولا
de: Schwächste zuerst
es: Más débil primero
fr: Les plus fragiles d'abord
hu: Leggyengébb elöl
it: Prima le più deboli
ja: 弱い順
ko: 약한 순
pt_br: Mais fraca Primeiro
pt_pt: Mais fraco primeiro
ru: Сначала слабые
uk: Спочатку слабкі
zh_hans: 按密码强度不安全的靠前

# sortby_password_strength_reverse_mode
source: Strongest First
ar: الأقوى أولاً
de: Stärkste zuerst
es: Más fuerte primero
fr: Les plus forts en premier
hu: Legerősebb elöl
it: Prima le più sicure
ja: 強い順
ko: 강한 순
pt_br: Mais forte Primeiro
pt_pt: Mais forte primeiro
ru: Сначала надёжные
uk: Спочатку надійні
zh_hans: 按密码强度安全的靠前

# sortby_password_strength_title
source: Password strength
ar: قوة كلمة المرور
de: Passwortstärke
es: Seguridad de la contraseña
fr: Robustesse du mot de passe
hu: Jelszó erőssége
it: Sicurezza password
ja: パスワード強度
ko: 비밀번호 보안 강도
pt_br: Força da senha
pt_pt: Segurança da palavra-passe
ru: Надёжность пароля
uk: Надійністю пароля
zh_hans: 按密码强度排序

# sortby_password_title
source: Password
ar: كلمة المرور
de: Passwort
es: Contraseña
fr: Mot de passe
hu: Jelszó
ja: パスワード
ko: 비밀번호
pt_br: Senha
pt_pt: Palavra-passe
ru: Пароль
uk: Паролем
zh_hans: 按密码排序

# sortby_title_normal_mode
source: Alphabetically
ar: أبجديا
de: Alphabetisch
es: Alfabético
fr: Alphabétiquement
hu: Betűrendben
it: Ordine alfabetico
ja: アルファベット順
ko: 가나다순
pt_br: Ordem Alfabética
pt_pt: Ordem alfabética
ru: По возрастанию (от A до Я)
uk: В алфавітному порядку
zh_hans: 按字母排序

# sortby_title_reverse_mode
source: Reverse Alphabetically
ar: عكس أبجديا
de: Umgekehrt Alphabetisch
es: Alfabético inverso
fr: Ordre anti-alphabétique
hu: Fordított betűrendben
it: Ordine alfabetico inverso
ja: アルファベット逆順
ko: 가나다 역순
pt_br: Ordem Alfabética Reversa
pt_pt: Ordem alfabética reversa
ru: По убыванию (от Я до А)
uk: Зворотний алфавітний порядок
zh_hans: 按字母反向排序

# sortby_title_title
source: Title
ar: عنوان
de: Titel
es: Título
fr: Titre
hu: Cím
it: Nome
ja: タイトル
ko: 제목
pt_br: Título
pt_pt: Nome
ru: Название
uk: Назвою
zh_hans: 标题

source: SSH agent
ar: وكيل SSH
es: Agente SSH
fr: Agent SSH
hu: SSH ügynök
it: Agente SSH
ja: SSH エージェント
ko: SSH 에이전트
pt_br: Agente SSH
pt_pt: Agente SSH
ru: SSH-агент
uk: SSH агент
zh_hans: SSH 代理

# ssh_agent_filters_header_title
source: SSH agent filters
ar: عوامل تصفية وكيل SSH
de: SSH-Agenten-Filter
es: Filtros del agente SSH
fr: Filtres de l'agent SSH
hu: SSH ügynök szűrők
it: Filtri per agente SSH
ja: SSHエージェント フィルタ設定
ko: SSH 에이전트 필터
pt_br: Filtros de agente SSH
pt_pt: Filtros de agente SSH
ru: Фильтры SSH-агента
uk: Фільтри SSH агента
zh_hans: SSH 代理过滤器

# ssh_agent_filters_note_save_to_apply
source: Changes apply after you press Save.
ar: ستُطبق التغييرات بعد الضغط على حفظ.
de: Änderungen werden nach dem Speichern übernommen.
es: Los cambios se aplican después de presionar Guardar.
fr: Les modifications seront appliquées après avoir cliqué sur Enregistrer.
hu: A változtatások a Mentés gomb megnyomása után lépnek érvénybe.
it: Le modifiche vengono applicate dopo aver premuto Salva.
ja: 変更は保存後に適用されます。
ko: 변경 사항은 저장을 누른 후 적용됩니다.
pt_br: As alterações se aplicam após pressionar Salvar.
pt_pt: As alterações serão aplicadas após clicar em guardar.
ru: Изменения вступят в силу после нажатия кнопки "Сохранить".
uk: Зміни застосовуються тільки після збереження.
zh_hans: 在您点击“保存”后应用更改。

# ssh_agent_history_all_accessible_keys
source: All accessible keys
ar: جميع المفاتيح المتاحة
de: Alle zugänglichen Schlüssel
fr: Toutes les clés accessibles
hu: Összes elérhető kulcs
pt_br: Todas as chaves acessíveis
pt_pt: Todas as chaves acessíveis
ru: Все доступные ключи
uk: Усі доступні ключі
zh_hans: 所有可访问的密钥

# ssh_agent_history_clear_history_confirmation_text
source: This will remove all SSH agent usage history.
ar: سيؤدي هذا إلى إزالة كل سجل استخدام وكيل SSH.
de: Dadurch wird der gesamte Nutzungsverlauf des SSH-Agenten entfernt.
fr: Ceci supprimera tout l'historique d'utilisation de l'agent SSH.
hu: Ez eltávolítja az SSH ügynök összes használati előzményét.
pt_br: Isso removerá todo o histórico de uso do agente SSH.
pt_pt: Isto irá remover todo o histórico de uso de agentes SSH.
ru: Это удалит всю историю использования SSH-агента.
uk: Це видалить усю історію використання SSH-агента.
zh_hans: 此操作将清除所有 SSH 代理使用历史记录。

# ssh_agent_history_clear_history_confirmation_title
source: Clear SSH agent history?
ar: مسح سجل وكيل SSH؟
de: SSH-Agenten-Verlauf löschen?
fr: Effacer l'historique de l'agent SSH ?
hu: Törli az SSH ügynök előzményeit?
pt_br: Limpar histórico do agente SSH?
pt_pt: Limpar histórico do agente SSH?
ru: Очистить историю SSH-агента?
uk: Очистити історію SSH-агента?
zh_hans: 清除 SSH 代理历史记录？

# ssh_agent_history_clear_history_title
source: Clear history
ar: مسح السجل
de: Verlauf leeren
fr: Effacer l'historique
hu: Előzmények törlése
pt_br: Limpar histórico
pt_pt: Limpar histórico
ru: Очистить историю
uk: Очистити історію
zh_hans: 清除历史记录

# ssh_agent_history_header_title
source: SSH agent history
ar: سجل وكيل SSH
de: SSH-Agenten-Verlauf
es: Historial del agente de SSH
fr: Historique de l'agent SSH
hu: SSH ügynök előzmények
pt_br: Histórico do agente SSH
pt_pt: Histórico do agente SSH
ru: История SSH-агента
uk: Історія SSH-агента
zh_hans: SSH 代理历史记录

# ssh_agent_history_request_list_keys
source: List keys
ar: عرض المفاتيح
de: Schlüssel auflisten
es: Listar llaves
fr: Lister les clés
hu: Kulcsok listázása
pt_br: Listar chaves
pt_pt: Listar chaves
ru: Список ключей
uk: Список ключів
zh_hans: 列出密钥

# ssh_agent_history_request_sign_data
source: Sign data
ar: توقيع البيانات
de: Daten signieren
es: Firmar datos
fr: Signer ces données
hu: Adatok aláírása
pt_br: Assinar dados
pt_pt: Dados de sinalização
ru: Подпись данных
uk: Підписати дані
zh_hans: 签名数据

# ssh_agent_history_response_failure
source: Failed
ar: فشل
de: Fehlgeschlagen
fr: Échec
hu: Sikertelen
pt_br: Falhou
pt_pt: Falhou
ru: Ошибка
uk: Помилка
zh_hans: 失败

# ssh_agent_history_response_key_not_found
source: Key not found
ar: لم يتم العثور على المفتاح
de: Schlüssel nicht gefunden
es: Llave no encontrada
fr: Clé introuvable
hu: A kulcs nem található
pt_br: Chave não encontrada
pt_pt: Chave não encontrada
ru: Ключ не найден
uk: Ключ не знайдено
zh_hans: 找不到密钥

# ssh_agent_history_response_success
source: Success
ar: نجاح
de: Erfolgreich
fr: Réussi
hu: Sikeres
ko: 성공
pt_br: Sucesso
pt_pt: Bem-sucedido
ru: Успешно
uk: Успішно
zh_hans: 成功

# ssh_agent_history_response_user_denied
source: Denied
ar: مرفوض
de: Abgelehnt
es: Denegado
fr: Refusé
hu: Megtagadva
ko: 거부됨
pt_br: Negado
pt_pt: Negado
ru: Отклонено
uk: Відхилено
zh_hans: 拒绝

# ssh_agent_history_response_vault_locked
source: Vault locked
ar: الخزنة مقفلة
de: Tresor gesperrt
fr: Coffre-fort verrouillé
pt_br: Cofre bloqueado
pt_pt: Cofre bloqueado
uk: Сховище заблоковано
zh_hans: 密码库已锁定

# ssh_agent_history_unknown_caller
source: Unknown caller
ar: متصل غير معروف
de: Unbekannter Aufrufer
fr: Appelant inconnu
hu: Ismeretlen hívó
ko: 알 수 없는 호출자
pt_br: Chamador desconhecido
pt_pt: Número desconhecido
ru: Неизвестный источник
uk: Невідомий запитувач
zh_hans: 未知调用方

# ssh_agent_history_unknown_key
source: Unknown key
ar: مفتاح غير معروف
de: Unbekannter Schlüssel
fr: Clé inconnue
hu: Ismeretlen kulcs
ko: 알 수 없는 키
pt_br: Chave desconhecida
pt_pt: Chave desconhecida
ru: Неизвестный ключ
uk: Невідомий ключ
zh_hans: 未知的密钥

# ssh_agent_request_approval_sign_message_known_app
source: %1$@ wants to use the following SSH key to sign data:
ar: يريد %1$@ استخدام مفتاح SSH التالي لتوقيع البيانات:
de: %1$@ möchte den folgenden SSH-Schlüssel verwenden, um Daten zu signieren:
es: %1$@ desea utilizar la siguiente clave SSH para firmar datos:
fr: %1$@ souhaite utiliser la clé SSH suivante pour signer les données :
hu: %1$@ a következő SSH kulcsot szeretné használni adatok aláírására:
it: %1$@ vuole utilizzare la seguente chiave SSH per firmare i dati:
ja: %1$@ が以下のSSHキーを使用してデータの署名を行おうとしています：
ko: %1$@이(가) 데이터를 서명하기 위해 다음 SSH 키를 사용하려고 합니다:
pt_br: %1$@ deseja usar a seguinte chave SSH para assinar dados:
pt_pt: %1$@ pretende utilizar a seguinte chave SSH para assinar dados:
ru: %1$@ хочет использовать следующий SSH-ключ для подписания данных:
uk: %1$@ хоче використати цей SSH-ключ для підпису даних:
zh_hans: %1$@ 请求使用以下 SSH 密钥对数据进行签名：

# ssh_agent_request_approval_sign_message_unknown_app
source: An application wants to use the following SSH key to sign data:
ar: يريد تطبيق ما استخدام مفتاح SSH التالي لتوقيع البيانات:
de: Eine Anwendung möchte den folgenden SSH-Schlüssel verwenden, um Daten zu signieren:
es: Una aplicación desea utilizar la siguiente clave SSH para firmar datos:
fr: Une application souhaite utiliser la clé SSH suivante pour signer les données :
hu: Egy alkalmazás a következő SSH kulcsot szeretné használni adatok aláírására:
it: Un'applicazione desidera utilizzare la seguente chiave SSH per firmare i dati:
ja: あるアプリケーションが以下のSSHキーを使用してデータの署名を行おうとしています：
ko: 애플리케이션이 데이터를 서명하기 위해 다음 SSH 키를 사용하려고 합니다:
pt_br: Um aplicativo deseja usar a seguinte chave SSH para assinar dados:
pt_pt: Uma aplicação deseja utilizar a seguinte chave SSH para assinar dados:
ru: Приложение хочет использовать следующий SSH-ключ для подписания данных:
uk: Застосунок хоче використати цей SSH-ключ для підпису даних:
zh_hans: 某应用请求使用以下 SSH 密钥对数据进行签名：

# ssh_agent_request_approval_sign_title
source: SSH Signing Request
ar: طلب توقيع SSH
de: SSH-Signierungsanfrage
es: Solicitud de firma SSH
fr: Demande de signature SSH
hu: SSH Aláírási Kérelem
it: Richiesta di firma SSH
ja: SSH署名リクエスト
ko: SSH 서명 요청
pt_br: Solicitação de assinatura SSH
pt_pt: Pedido de assinatura SSH
ru: Запрос на подписание SSH
uk: Запит на підпис від SSH клієнта
zh_hans: SSH 签名请求

# ssh_agent_setup_android_how_does_it_work_1
source: The SSH agent receives requests from SSH tools, then forwards them to the Keyguard app instead of handling the sensitive operation itself.
ar: يتلقى وكيل SSH الطلبات من أدوات SSH، ثم يمرّرها إلى تطبيق Keyguard بدلاً من تنفيذ العملية الحساسة بنفسه.
de: Der SSH-Agent empfängt Anfragen von SSH-Programmen und leitet sie an die Keyguard-App weiter, statt den sensiblen Vorgang selbst auszuführen.
es: El agente SSH recibe peticiones de las herramientas SSH y luego las reenvía a la aplicación GuardaKeyguard en lugar de manejar la operación sensible en sí.
fr: L'agent SSH reçoit les requêtes des outils SSH, puis les transmet à Keyguard au lieu de gérer l'opération sensible lui-même.
hu: Az SSH ügynök fogadja a kéréseket az SSH eszközöktől, majd továbbítja őket a Keyguard alkalmazásnak, ahelyett hogy maga végezné el az érzékeny műveletet.
pt_br: O agente SSH recebe solicitações de ferramentas SSH e as encaminha para o aplicativo Keyguard em vez de lidar com a operação confidencial sozinho.
pt_pt: O agente SSH recebe pedidos de ferramentas SSH e encaminha-os para a aplicação Keyguard, em vez de lidar com a operação sensível por conta própria.
uk: SSH-агент отримує запити від SSH-інструментів і пересилає їх до застосунку Keyguard, замість того щоб самостійно виконувати цю конфіденційну операцію.
zh_hans: SSH 代理接收来自 SSH 工具的请求，再将其转发给 Keyguard 应用，而非由自身处理敏感操作。

# ssh_agent_setup_android_how_does_it_work_2
source: The communication is done in two steps: first the agent signals the app to start a session, then both sides connect over a local TCP channel and exchange encrypted messages. The SSH agent acts as a relay, while the Keyguard app performs the actual operations.
ar: تتم الاتصالات على خطوتين: أولاً يشير الوكيل إلى التطبيق لبدء جلسة، ثم يتصل الطرفان عبر قناة TCP محلية ويتبادلان رسائل مشفّرة. يعمل وكيل SSH كمرحّل، بينما ينفّذ تطبيق Keyguard العمليات الفعلية.
de: Die Kommunikation erfolgt in zwei Schritten: Zunächst signalisiert der Agent der App, eine Sitzung zu starten. Anschließend verbinden sich beide Seiten über einen lokalen TCP-Kanal und tauschen verschlüsselte Nachrichten aus. Der SSH-Agent dient als Vermittler, während die Keyguard-App die eigentlichen Vorgänge ausführt.
es: La comunicación se realiza en dos pasos: primero el agente indica la aplicación para iniciar una sesión, entonces ambos lados conectan a través de un canal TCP local y intercambian mensajes cifrados. El agente SSH actúa como un repetidor, mientras que la aplicación Guardián realiza las operaciones reales.
fr: La communication se fait en deux étapes: tout d'abord l'agent demande à l'application de démarrer une session, puis les deux parties se connectent via un canal TCP local et échangent des messages chiffrés. L'agent SSH sert de relais, tandis que Keyguard effectue l'opération réelle.
hu: A kommunikáció két lépésben történik: először az ügynök jelez az alkalmazásnak, hogy kezdjen egy munkamenetet, majd mindkét oldal csatlakozik egy helyi TCP csatornán keresztül, és titkosított üzeneteket cserél. Az SSH ügynök közvetítőként működik, míg a Keyguard alkalmazás végzi el a tényleges műveleteket.
pt_br: A comunicação é feita em duas etapas: primeira, o agente sinaliza ao aplicativo para iniciar uma sessão, depois ambos os lados se conectam por meio de um canal TCP local e trocam mensagens criptografadas. O agente SSH atua como um retransmissor, enquanto o aplicativo Keyguard executa as operações reais.
pt_pt: A comunicação é feita em dois passos: primeiro, o agente sinaliza à aplicação para iniciar uma sessão, em seguida, ambos os lados ligam-se através de um canal TCP local e trocam mensagens encriptadas. O agente SSH atua como intermediário, enquanto a aplicação Keyguard executa as operações propriamente ditas.
uk: Зв'язок відбувається у два етапи: спочатку агент подає сигнал застосунку для початку сеансу, після чого обидві сторони з'єднуються через локальний TCP-канал і обмінюються зашифрованими повідомленнями. SSH-агент виконує роль ретранслятора, тоді як застосунок Keyguard здійснює операції.
zh_hans: 通信分两步进行：代理先通知应用启动会话，双方再通过本地 TCP 通道建立连接并交换加密消息。SSH 代理充当中继，实际操作由 Keyguard 应用执行。

# ssh_agent_setup_android_how_does_it_work_title
source: How does it work
ar: كيف يعمل
de: Funktionsweise
es: ¿Cómo funciona?
fr: Comment ça marche ?
hu: Hogyan működik
pt_br: Como funciona
pt_pt: Como funciona
uk: Як це працює
zh_hans: 工作原理

# ssh_agent_setup_android_termux_step_1_text
source: Termux is an Android terminal application and Linux environment.
ar: Termux هو تطبيق طرفية لنظام Android وبيئة Linux.
de: Termux ist eine Terminal-App und eine Linux-Umgebung für Android.
es: Termux es una aplicación de terminal Android y entorno Linux.
fr: Termux est une application de terminal Android et un environnement Linux.
hu: A Termux egy Android terminál alkalmazás és Linux környezet.
it: Termux è un'applicazione terminale e ambiente Linux per Android.
ko: Termux는 Android 터미널 앱 및 Linux 환경을 제공합니다.
pt_br: Termux é um aplicativo de terminal Android e ambiente Linux.
pt_pt: O Termux é uma aplicação de terminal para Android e um ambiente Linux.
uk: Termux — це термінальний застосунок для Android та середовище Linux.
zh_hans: Termux 是一款 Android 终端应用及 Linux 环境。

# ssh_agent_setup_android_termux_step_1_title
source: Install Termux
ar: تثبيت Termux
de: Termux installieren
es: Instalar Termux
fr: Installer Termux
hu: A Termux telepítése
it: Installa Termux
ko: Termux 설치
pt_br: Instalar o Termux
pt_pt: Instalar Termux
uk: Встановити Termux
zh_hans: 安装 Termux

# ssh_agent_setup_android_termux_step_2_text
source: Open Termux and install the package from a custom APT repository:
ar: افتح Termux وثبّت الحزمة من مستودع APT مخصّص:
de: Öffnen Sie Termux und installieren Sie das Paket aus einem benutzerdefinierten APT-Repository:
es: Abra Termux e instale el paquete desde un repositorio APT personalizado:
fr: Ouvrez Termux et installez le paquet depuis un dépôt APT personnalisé :
hu: Nyissa meg a Termuxot, és telepítse a csomagot egy egyéni APT tárolóból:
it: Apri Termux e installa il pacchetto da un repository APT personalizzato:
ko: Termux를 열고 추가 APT 저장소에서 패키지를 설치하세요.
pt_br: Abra o Termux e instale o pacote de um repositório APT personalizado:
pt_pt: Abra o Termux e instale o pacote a partir de um repositório APT personalizado:
uk: Відкрийте Termux та встановіть пакет з APT-репозиторію:
zh_hans: 打开 Termux，从自定义 APT 仓库安装软件包：

# ssh_agent_setup_android_termux_step_2_title
source: Install package
ar: تثبيت الحزمة
de: Paket installieren
es: Instalar paquete
fr: Installer le paquet
hu: Csomag telepítése
it: Installa pacchetto
ko: 패키지 설치
pt_br: Instalar pacote
pt_pt: Instalar pacote
uk: Встановити пакет
zh_hans: 安装软件包

# ssh_agent_setup_android_termux_step_3_shell_current
source: Start the package and export the socket into your current shell:
ar: ابدأ الحزمة وصدّر المقبس إلى صدفتك الحالية:
de: Starten Sie das Paket und exportieren Sie den Socket in Ihre aktuelle Shell:
es: Inicie el paquete y exporte el socket a su shell actual:
fr: Démarrez le paquet et exportez le socket dans votre terminal actuel :
hu: Indítsa el a csomagot, és exportálja a socketet a jelenlegi shellbe:
it: Avvia il pacchetto ed esporta il socket nella shell corrente:
ko: 패키지를 시작하고 소켓을 현재 사용 중인 셸에 노출시키세요.
pt_br: Inicie o pacote e exporte o soquete para o seu shell atual:
pt_pt: Inicie o pacote e exporte o socket para o seu shell atual:
uk: Запустіть програму та експортуйте сокет:
zh_hans: 启动软件包并将套接字导出到当前 Shell：

# ssh_agent_setup_android_termux_step_3_shell_startup
source: If you want to auto-start the package every time Termux starts, add it to your shell startup file:
ar: إذا أردت تشغيل الحزمة تلقائيًا في كل مرة يبدأ فيها Termux، فأضفها إلى ملف بدء تشغيل الصدفة:
de: Wenn das Paket bei jedem Start von Termux automatisch gestartet werden soll, fügen Sie es Ihrer Shell-Startdatei hinzu:
es: Si quieres auto-iniciar el paquete cada vez que Termux se inicie, añádelo al archivo de inicio del shell:
fr: Si vous voulez démarrer automatiquement le paquet chaque fois que Termux démarre, ajoutez-le à votre fichier de démarrage du terminal :
hu: Ha azt szeretné, hogy a csomag automatikusan elinduljon a Termux minden indulásakor, adja hozzá a shell indítási fájljához:
ko: Termux를 켤 때마다 패키지가 자동으로 시작되게 하려면 다음 내용을 셸 시작 파일에 추가하세요.
pt_br: Se você deseja iniciar automaticamente o pacote sempre que o Termux for iniciado, adicione-o ao arquivo de inicialização do shell:
pt_pt: Se pretender que o pacote seja iniciado automaticamente sempre que o Termux for iniciado, adicione-o ao seu ficheiro de arranque da shell:
uk: Якщо ви хочете, щоб пакет запускався автоматично під час кожного запуску Termux, додайте його до стартового файлу вашого терміналу:
zh_hans: 若希望每次 Termux 启动时自动运行该软件包，请将其添加到 Shell 启动文件中：

# ssh_agent_setup_android_termux_step_3_title
source: Configure your SSH client
ar: إعداد عميل SSH
de: SSH-Client konfigurieren
es: Configurar su cliente SSH
fr: Configurer son client SSH
hu: SSH kliens konfigurálása
it: Configura il tuo client SSH
ko: SSH 클라이언트 설정
pt_br: Configure seu cliente SSH
pt_pt: Configure o seu cliente SSH
uk: Налаштуйте ваш SSH-клієнт
zh_hans: 配置 SSH 客户端

# ssh_agent_setup_android_termux_step_4_text
source: Run these commands in the same shell session where you configured the agent.
ar: شغّل هذه الأوامر في نفس جلسة الصدفة التي أعددت فيها الوكيل.
de: Führen Sie diese Befehle in derselben Shell-Sitzung aus, in der Sie den Agenten konfiguriert haben.
es: Ejecute estos comandos en la misma sesión de shell donde configuró el agente.
fr: Exécutez ces commandes dans la même session de terminal où vous avez configuré l'agent.
hu: Futtassa ezeket a parancsokat ugyanabban a shell munkamenetben, ahol az ügynököt konfigurálta.
it: Esegui questi comandi nella stessa sessione di shell su cui è stato configurato l'agente.
ko: 에이전트를 설정한 세션과 같은 세션에서 다음 명령어를 실행하세요.
pt_br: Execute esses comandos na mesma sessão de shell em que você configurou o agente.
pt_pt: Execute estes comandos na mesma sessão de shell em que configurou o agente.
uk: Виконайте ці команди в тому ж сеансі терміналу, де ви налаштували агента.
zh_hans: 请在配置代理时所用的同一 Shell 会话中执行以下命令。

# ssh_agent_setup_android_termux_step_4_title
source: Verify
ar: تحقق
de: Überprüfen
es: Verificar
fr: Vérifier
hu: Ellenőrzés
it: Verifica
ko: 검증
pt_br: Verificar
pt_pt: Verificar
uk: Перевірка
zh_hans: 验证
